

#1.1Създайте вектор с коефициенти на име BETA със стойности 3 и 10

BETA = c(3,10)

#1.2 Създайте матрица M с размер 20 на 2 от вектор X

X <- c(1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.12, 0.17, 
       0.13, 0.89, 0.51, 0.96, 0.33, 0.38, 0.21, 0.84, 0.68, 0.29, 0.84, 0.94, 
       0.79, 0.99, 0.34, 0.97, 0.04, 0.87)

M = matrix(X,20,2,FALSE)


#1.3Създайте вектор Y като сумирате умножение на елементите от двата вектора 
# BETA с всеки ред от матрицата M. Можете да използвате цикъл или apply.

Y = apply(M,MARGIN = 1,FUN = function(x,a) { sum(x*a)}, a  = BETA)

#1.4Към вектора Y добавете вектора 0.3*NOISE
set.seed(9907)
NOISE = rnorm(20)
Y + 0.3*NOISE

#     1.5. Напишете финкция "estim_F", която, приема четири параметъра - 
# y (вектор), x (вектор), a (скалар) и b (скалар)
#     На параметъра "x" се присвоява втората колона от M
#     В тялото на функцията:
#       - първо се изчислява вектор "prediction" по формулата a + b*x. 
#       - после се изчислява вектор "resid" по формулата y - prediction.
#       - следваща стъпка е векторът "resid" да се вдигне на квадрат и да се сумират 
# стойностите на новополучения вектор. Това е и стойността, която функцията
# трябва да се върне


estim_F = function(x,y,a,b){
  prediction = a+b*x
  resid = y - prediction
  resid = resid^2
  return (sum(resid^2))
  
}

res1 = estim_F(Y,M[,2],1,2)

res2 = estim_F(Y,M[,2],-3,17)

res3 = estim_F(Y,M[,2],2.9,9.7)

res4 = estim_F(Y,M[,2],3.2,10.1)

res = c(res1,res2,res3,res4)

res1
res2
res3
res4

which.min(res)

#Task_2 from past exam

n = 100
x = 3.762

# return the sum x^i where i = 1,...,n

task_2_func = function(n,x){
  return (sum(x^(1:n)))
}
task_2_func(n,x)



























