

# БИНОМНО РАЗПРЕДЕЛЕНИЕ

# Зад.1 
#       Застрахователно дружество има портфейл от 20 полици. Вероятността за щета по  
#   всяка една полица е 0.13. Полиците са независими една от друга.
#   Определете:

#a не повече => pbinom

pbinom(2,20,0.13)

#b) at least 4

1 - pbinom(3,20,0.13)


#c) between 3 and 7

dbinom(3,20,0.13) + dbinom(4,20,0.13) + dbinom(5,20,0.13) + dbinom(6,20,0.13) + dbinom(7,20,0.13)

# d) just 5 

dbinom(5,20,0.13)

# e) минималният брой на настъпилите щети в 10% от най-лошите сценарии

qbinom(p = 0.1, size = SIZE, prob = PR, lower.tail = FALSE) # idk why


# ГЕОМЕТРИЧНО РАЗПРЕДЕЛЕНИЕ


# Зад.2
#       Баскетболист вкарва кош с вероятност от 30%. Определете:
#       a) вероятността за точно 4 неуспеха до настъпването на успех (вкарване на кош)

dgeom(4,0.3)

#       б) вероятността за по-малко от 7 (включително) неуспеха до вкарване на кош

pgeom(7,0.3)

#       в) вероятността за да имаме между 3 и 9 неуспеха включително до вкарване на кош
PROB_RES = 0

for(i in 3:9){
  PROB_RES = PROB_RES + dgeom(i,0.3)
}

PROB_RES

#       г) най-малко 7 неуспеха (включително) до вкарване на кош.

1 - pgeom(6,0.3)

#       д) Каква е вероятността за най-малко 5 неуспеха, при вече направени 3 "изтрела",
#   които са пропуски.

#       Използвайки memoryless => P(X >= 5 | X > 3) = P(X >= 5 - 3) = P(X >= 2)
#   P(X >= 2) = 1 - P(X < 2) = 1 - P(X <= 2 - 1) = 1 - P(X <= 1)
1 - pgeom(1, PR)

# ОТРИЦАТЕЛНО БИНОМНО

# Зад.3
#       Баскетболист вкарва кош с вероятност от 15%. Определете:
#       a) вероятността за точно 4 неуспеха до настъпването на 2 коша/успеха

dnbinom(4,2,0.15)
#       б) вероятността за по-малко от 7 неуспеха (включително) до вкарване на 2 коша/успеха

pnbinom(7,2,0.15)

#       в) вероятността за да имаме между 3 и 9 неуспеха включително до вкарване 
#   на 2 коша/успеха

RES = 0
for ( i in 3:9){
  RES = RES + dnbinom(i,2,0.15)
}
#       г) най-малко 7 неуспеха (включително) до вкарване на 2 коша

1 - pnbinom(6,2,0.15)


# ПОАСОНОВО РАЗПРЕДЕЛЕНИЕ

# Зад.4
#       В болницата X от 14:00 до 18:00 всеки ден имаме по 6 пациента със счупена кост:

# => lambda is 6

#       a) вероятността за да имаме точно 10 пациента със счупена кост в този интервал

# 10 people

dpois(10,6)

#       б) вероятността за да имаме по-малко от 9 пациента (включително) със счупена кост в този интервал

ppois(9,6)
#       в) вероятността за да имаме между 13 и 19 пациента (включително) със счупена кост в този интервал

ppois(19,6) - ppois(12,6)

#       г) най-малко 20 пациента със счупена кост в този интервал

1 - ppois(19,6)


# РАВНОМЕРНО РАЗПРЕДЕЛЕНИЕ


# Зад.5
#       Закъснението на влак от БДЖ е равномерна разпределена случайна величина
#   в интервала 10 - 30 минути
#       Определете:
#       a) вероятността влакът да закъснее под 15 минути
punif(15,10,30)
#       б) вероятността влакът да закъснее над 40 минути
1- punif(40,10,30)
#       в) вероятността влакът да закъснее над 25 минути

1 - punif(25,10,30)
#       в) вероятността влакът да закъснее между 15 и 35 минути

RES = 0
for (i in 15:35){
  RES = RES + dunif(i,10,30)
}
RES


#НОРМАЛНО РАЗПРЕДЕЛЕНИЕ


# Зад.6
#       След проведен тест за интелигентност на целия ръководен персонал в банка X
#   Стойностите са нормално разпределени, със следните резултати - очаквано IQ = 90 
#   и стандартно отклонение на IQ = 25.
#       Определете:
#       a) вероятността директор от въпросната банка да има IQ под 60
pnorm(60,90,25)
#       б) вероятността директор в банката да има IQ над 130
1 - pnorm(130,90,25)
#       в) вероятността директор в банката да има IQ между 60 и 130

pnorm(130,90,25) - pnorm(60,90,25)

#       г) минималното IQ-то на най-умните 5% от ръководния персонал на банката
#95% quantile

qnorm(1-0.05,90,25)


MU = 90
SIGMA = 25

# ЕКСПОНЕНЦИАЛНО РАЗПРЕДЕЛЕНИЕ


# Зад.7
#       Времето за настъпване на събитие е експоненциално разпределена величина с 
#   очакване 1/lambda = 10 (rate) мерни единици.
#       Определете:
#       a) вероятността събитие да настъпи за по-малко от 4 мерни единици

LAMBDA = 0.1
pexp(4,LAMBDA)


#       б) вероятността събитие да настъпи за повече от 16 мерни единици

1 - pexp(16,LAMBDA)
#       в) вероятността събитие да настъпи между 4 и 16

pexp(16,LAMBDA) = pexp(4,LAMBDA)


# Гама разпределение



# Зад.8
#       В лаборатория изучават продължителността на живота на вид насекоми в контролирана 
#   лабораторна среда. От събраните данни станало ясно, че продължителността на насекомите 
#   (измерена в дни) следва гама разпределение с параметри k = 2.7 и thita = 6 дни.
#       Изчислете вероятността произволно избрано насекомо да живее:
#       a) поне 10 дни
1 - pgamma(10,SHAPE,SCALE)
#       б) между 5 и 10 дни (включително)

pgamma(10,SHAPE,SCALE) - pgamma(4,SHAPE,SCALE)
#       в) да живее по-малко от 7.5 дена

pgamma(7.5,SHAPE,SCALE)

SCALE = 6
SHAPE = 2.7


























